; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v3 ?v2)
             (pred_7 ?v6 ?v7)
             (pred_6 ?v3 ?v7)
             (pred_1 ?v5 ?v3 )
	     (pred_10 ?v3)
             (pred_3 ?v8)
             (pred_9 ?v6)
             (pred_4 ?v7)
             (pred_2 ?v3)
             (pred_8 ?v6)
             (pred_12 ?v3)
             (pred_11 ))



(:action op_2
:parameters (?v9 ?v12 ?v4 ?v1)
:precondition (and (pred_3 ?v9) (pred_3 ?v12) (pred_9 ?v4) (pred_4 ?v1)
          (pred_5 ?v9 ?v12) (pred_7 ?v4 ?v1)
                   (pred_6 ?v12 ?v1) (pred_10 ?v9) 
                   (pred_2 ?v12) (pred_8 ?v4))
:effect (and  (pred_12 ?v12) (not (pred_2 ?v12))))


(:action op_3
:parameters (?v9 ?v13)
:precondition (and (pred_3 ?v9) (pred_3 ?v13)
               (pred_10 ?v9) (pred_5 ?v9 ?v13) (pred_12 ?v13))
:effect (and (pred_10 ?v13) (not (pred_10 ?v9))))

(:action op_1
:parameters (?v9 ?v4)
:precondition (and (pred_3 ?v9) (pred_9 ?v4) 
                  (pred_10 ?v9) (pred_1 ?v4 ?v9) (pred_11 ))
:effect (and (pred_8 ?v4)
   (not (pred_1 ?v4 ?v9)) (not (pred_11 ))))


(:action op_4
:parameters (?v9 ?v11 ?v10)
:precondition (and (pred_3 ?v9) (pred_9 ?v11) (pred_9 ?v10)
                  (pred_10 ?v9) (pred_8 ?v10) (pred_1 ?v11 ?v9))
:effect (and (pred_8 ?v11) (pred_1 ?v10 ?v9)
        (not (pred_8 ?v10)) (not (pred_1 ?v11 ?v9))))

(:action op_5
:parameters (?v9 ?v4)
:precondition (and (pred_3 ?v9) (pred_9 ?v4) 
                  (pred_10 ?v9) (pred_8 ?v4))
:effect (and (pred_11 ) (pred_1 ?v4 ?v9) (not (pred_8 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_18 obj_04 obj_03 obj_02 obj_08 obj_09 obj_06 obj_12 obj_07 obj_10 obj_13 obj_19 obj_05 obj_17 obj_16 obj_01
    obj_11 obj_20
    obj_15 obj_14
    )

    (:init
       (pred_11)

       (pred_3 obj_18)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_09)
       (pred_3 obj_06)
       (pred_3 obj_12)
       (pred_3 obj_07)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_05)
       (pred_3 obj_17)
       (pred_3 obj_16)
       (pred_3 obj_01)
       (pred_4 obj_11)
       (pred_4 obj_20)
       (pred_9 obj_15)
       (pred_9 obj_14)

       (pred_5 obj_18 obj_08)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_03)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_03 obj_04)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_08 obj_07)
       (pred_5 obj_08 obj_09)
       (pred_5 obj_08 obj_18)
       (pred_5 obj_09 obj_10)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_08)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_12)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_06)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_07 obj_08)
       (pred_5 obj_10 obj_17)
       (pred_5 obj_10 obj_13)
       (pred_5 obj_10 obj_09)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_05 obj_17)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_17 obj_10)
       (pred_5 obj_17 obj_05)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_16)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_6  obj_08 obj_11)
       (pred_6  obj_19 obj_20)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_03)
       (pred_12 obj_02)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_12)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_13)
       (pred_12 obj_05)
       (pred_12 obj_17)
       (pred_12 obj_16)
       (pred_12 obj_01)

       (pred_7  obj_15 obj_11)
       (pred_7  obj_14 obj_20)
       (pred_1 obj_15 obj_13)
       (pred_1 obj_14 obj_07)
       (pred_10 obj_16)
    )

    (:goal (and
       (pred_1 obj_14 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_17)))
)
)

; plan
1. (op_3 obj_16 obj_13)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_10)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_10)
   goals met: 0 of 1
3. (op_3 obj_10 obj_07)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_07)
   goals met: 0 of 1
4. (op_1 obj_07 obj_14)
   deleted: (pred_1 obj_14 obj_07) (pred_11)
   added: (pred_8 obj_14)
   goals met: 0 of 1
5. (op_3 obj_07 obj_05)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_05)
   goals met: 0 of 1
6. (op_5 obj_05 obj_14)
   deleted: (pred_8 obj_14)
   added: (pred_11) (pred_1 obj_14 obj_05)
   goals met: 1 of 1
